In [1]:
import pandas as pd
from datetime import datetime as dt

In [2]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [3]:
 # Convert the date column format from string to datetime
df['date'] = pd.to_datetime(df['date'], format="%Y-%m-%d")
df.head()

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

In [4]:
june = df[df['date'].dt.month==6]
june['tobs'].mean()

74.94411764705882

In [5]:
# Set the date column as the DataFrame index
# Drop the date column
df2 = df.set_index(keys='date', drop=True)
df2.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

<h2> Compare June and December data across all years</h2>

In [6]:
from scipy import stats

In [26]:
# Filter data for desired months
june = df2.loc[(df2.index.month==6)]
december = df2.loc[(df2.index.month==12)]
june.tobs

date
2010-06-01    78
2010-06-02    76
2010-06-03    78
2010-06-04    76
2010-06-05    77
              ..
2017-06-26    79
2017-06-27    74
2017-06-28    74
2017-06-29    76
2017-06-30    75
Name: tobs, Length: 1700, dtype: int64

In [8]:
# Identify the average temperature for June
june_tobs = june['tobs'].mean()
june_tobs

74.94411764705882

In [9]:
 # Identify the average temperature for December
dec_tobs = december['tobs'].mean()
dec_tobs

71.04152933421226

In [21]:
# Run paired t-test
stats.ttest_ind(june.tobs, december.tobs, equal_var=False)

Ttest_indResult(statistic=31.355036920962423, pvalue=4.193529835915755e-187)